In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A -0.751245 -1.282106 -1.192855  1.778932
B -0.392040 -0.367053 -0.222995 -0.447435
C  0.180136 -1.042649  1.113305  0.524722
D -1.424757 -0.472261 -0.472913 -1.890603
E -1.644545 -0.379276  0.554451 -0.619393

In [6]:
df['W']

A   -0.751245
B   -0.392040
C    0.180136
D   -1.424757
E   -1.644545
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df['new'] = df['X']+df['Y']

In [10]:
df['new']

A   -2.474961
B   -0.590048
C    0.070656
D   -0.945174
E    0.175175
Name: new, dtype: float64

In [11]:
df

          W         X         Y         Z       new
A -0.751245 -1.282106 -1.192855  1.778932 -2.474961
B -0.392040 -0.367053 -0.222995 -0.447435 -0.590048
C  0.180136 -1.042649  1.113305  0.524722  0.070656
D -1.424757 -0.472261 -0.472913 -1.890603 -0.945174
E -1.644545 -0.379276  0.554451 -0.619393  0.175175

In [12]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.751245 -1.282106 -1.192855  1.778932
B -0.392040 -0.367053 -0.222995 -0.447435
C  0.180136 -1.042649  1.113305  0.524722
D -1.424757 -0.472261 -0.472913 -1.890603
E -1.644545 -0.379276  0.554451 -0.619393

In [13]:
#drop method is used to delete a specific column or row by mentioning the axis=0 or 1

In [14]:
df.loc['C']

W      0.180136
X     -1.042649
Y      1.113305
Z      0.524722
new    0.070656
Name: C, dtype: float64

In [15]:
df.iloc[2]

W      0.180136
X     -1.042649
Y      1.113305
Z      0.524722
new    0.070656
Name: C, dtype: float64

In [16]:
#.loc[] and .iloc[] are the 2 methods that selects the rows in a data frame

In [17]:
df.shape

(5, 5)

In [18]:
df.loc[['A','E'],['W','X']]

          W         X
A -0.751245 -1.282106
E -1.644545 -0.379276

In [19]:
df>0

       W      X      Y      Z    new
A  False  False  False   True  False
B  False  False  False  False  False
C   True  False   True   True   True
D  False  False  False  False  False
E  False  False   True  False   True

In [20]:
booldf =df>0

In [21]:
df[booldf]

          W   X         Y         Z       new
A       NaN NaN       NaN  1.778932       NaN
B       NaN NaN       NaN       NaN       NaN
C  0.180136 NaN  1.113305  0.524722  0.070656
D       NaN NaN       NaN       NaN       NaN
E       NaN NaN  0.554451       NaN  0.175175

In [22]:
resultdf = df[df['W']>0]

In [23]:
resultdf['X']

C   -1.042649
Name: X, dtype: float64

In [24]:
df[df['W']>0]['X']

C   -1.042649
Name: X, dtype: float64

In [25]:
df[df['W']>0][['Y','X']]

          Y         X
C  1.113305 -1.042649

In [26]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
C  1.113305 -1.042649

In [27]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z       new
C  0.180136 -1.042649  1.113305  0.524722  0.070656

In [28]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z       new
C  0.180136 -1.042649  1.113305  0.524722  0.070656

In [29]:
df.reset_index()

  index         W         X         Y         Z       new
0     A -0.751245 -1.282106 -1.192855  1.778932 -2.474961
1     B -0.392040 -0.367053 -0.222995 -0.447435 -0.590048
2     C  0.180136 -1.042649  1.113305  0.524722  0.070656
3     D -1.424757 -0.472261 -0.472913 -1.890603 -0.945174
4     E -1.644545 -0.379276  0.554451 -0.619393  0.175175

In [30]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [31]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [32]:
df

             A         B
G1 1  0.054385 -0.222187
   2 -0.722901  0.775469
   3  1.216779 -0.558357
G2 1  1.789822  1.236182
   2 -0.952687  1.403937
   3  1.528171  1.367804

In [33]:
df.loc['G1']

          A         B
1  0.054385 -0.222187
2 -0.722901  0.775469
3  1.216779 -0.558357

In [34]:
df.loc['G1'].loc[1]

A    0.054385
B   -0.222187
Name: 1, dtype: float64

In [35]:
df.index.names = ['Group','Num']

In [2]:
df

NameError: name 'df' is not defined

In [3]:
import numpy as np
import pandas as pd

In [4]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [8]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [9]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
byComp = df.groupby('Company')

In [13]:
byComp

In [14]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [15]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [16]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [17]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [19]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [20]:
#Merging, Joining and Concatenating

In [22]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                   index=[0,1,2,3])

In [23]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                   index=[4,5,6,7])

In [25]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                   index=[8,9,10,11])

In [26]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [27]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [28]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [29]:
 pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [30]:
 pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [31]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [32]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [33]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [34]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [38]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])

right = pd.DataFrame({'C':['C0','C2','C3'],
                    'D':['D0','D2','D3']},
                    index=['K0','K2','K3'])

In [39]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2